
###Ввести с клавиатуры 10 пар чисел.
###сравнить числа в каждой паре и напечатать большие из них
##i=1
##while i <= 10:
##    a=int(input())
##    b=int(input())
##    if a > b:
##        print(a)
##    elif b > a:
##        print(b)
##    else:
##        b = a
##        print("=")
##    i+=1







###Даны натуральные числа от 20 до 50.
###Напечатать те из них, которые делятся на 3, но не делятся на 5
##i=1
##while i<=10:
##   for a in range(20,50):
##    if a %3==0 and a%5!=0:
##        print(a)
##    i+=1










###даны натуральные числа от 35 до 87.
###Найти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5
##i=1
##while i<=10:
##    for a in range(35,88):
##        if a %7== 1 or a%7==2 or a%7==5:
##            print(a)
##        i+=1








###Напечатать те из двузначных чисел которые делятся на 4, но не делятся на 6
##i=1
##while i<=10:
##    for a in range (10,100):
##        if a %4==0 and not a%6==0:
##            print(a)
##        i+=1







#Даны натуральные числа от 1 до 50.
#Найти сумму тех из них, которые делятся на 5 или на 7
i=1
while i <=10:
    for a in range(1,51):
    S = a += a
    if s %7==0 or s%5==0
        print(s)
    i+=1
































































